Repository: skip405/kickbox-gf
Catalog: languages/kickbox-gf-*.po
Languages: ru_ru

source: Kickbox Settings
ru_ru: Настройки Kickbox

source: Enter your API key here
ru_ru: Введите API-ключ здесь

source: Kickbox API Key
ru_ru: API-ключ для Kickbox

source: Documentation
ru_ru: Документация

source: Disable Kickbox Verification
ru_ru: Отключить проверку от Kickbox

source: Tick this if you want to disable Kickbox Verifications globally, even if they are enabled in forms.
ru_ru: Поставьте галочку, если вы хотите отключить проверку глобально, даже если она включена в формах.

source: Disabled
ru_ru: Выключено

source: Verification Results Caching Settings
ru_ru: Параметры кэширования результатов проверки

source: Enable this setting if you want to cache Kickbox Verification Results and store them in the database. This will allow you to avoid excessive checking when multiple submissions from the same user are expected.
ru_ru: Включите этот параметр, если вы хотите сохранять результаты проверки в базе данных. Это позволит избежать повторных проверок для одного и того же пользователя.

source: Enable Kickbox Verification Results Caching
ru_ru: Включить кэширование

source: Enabled
ru_ru: Включено

source: Caching Duration (in days)
ru_ru: Длительность кэширования (в днях)

source: Default duration is %1$s days.
ru_ru: По умолчанию длительность составляет %1$s дней.

# Cache is a verb here
source: Cache Domains
ru_ru: Кэшировать домены

source: Emails are used as cache keys. By default this will verify both %1$s and %2$s. When enabled, verifications will be cached for %3$s and %4$s will not be verified.
ru_ru: По умолчанию в качестве идентификатора кэша используется адрес электронной почты. Такой подход проверит и %1$s, и %2$s. Этот параметр позволит закэшировать проверки для %3$s и адрес %4$s не будет проверен.

source: Verification configuration allows you to choose what you can afford to receive as a valid response from Kickbox.
ru_ru: Конфигурация проверки позволяет настроить, какие результаты считать приемлемыми.

source: Strict
ru_ru: Строгая

source: allows %1$s emails only with Sendex of %2$s and higher.
ru_ru: разрешает адреса электронной почты с результатом %1$s с показателем Sendex в %2$s и выше.

source: Permissive
ru_ru: Щадящая

source: allows emails with result types %1$s, %2$s and %3$s with Sendex of %4$s and higher.
ru_ru: разрешает адреса с результатами %1$s, %2$s и %3$s с показателем Sendex в %4$s и выше.

source: Custom
ru_ru: Произвольная

source: allows you to set everything up (see section below).
ru_ru: позволяет настроить самостоятельно (см. раздел ниже).

source: doesn't override the configuration from the plugin settings.
ru_ru: не переопределяет настройки.

source: Verify the value from this field via Kickbox
ru_ru: Проверить значение из этого поля через Kickbox

source: Use these settings to override the plugin defaults.
ru_ru: Данные настройки переопределяют настройки со страницы плагина.

source: Configuration type on the plugin settings page:
ru_ru: Конфигурация на странице настроек плагина:

source: Kickbox Verification Settings
ru_ru: Настройки проверки от Kickbox

source: Verification Configuration
ru_ru: Конфигурация проверки

source: These settings work if %1$s is chosen as the Verification Configuration above.
ru_ru: Эти настройки применяются, если выбрана %1$s конфигурация.

source: These settings work if %1$s is chosen as the Verification Configuration above or on the plugin settings page.
ru_ru: Они применяются, если выбрана %1$s конфигурация выше или на странице настроек плагина.

source: Custom Configuration Settings
ru_ru: Настройки произвольной конфигурации

source: Choose which Kickbox result types are considered valid (will not result in a validation error).
ru_ru: Выберите, какие результаты считать приемлемыми (не показывать сообщение об ошибке).

source: Valid Kickbox Result Types
ru_ru: Приемлемые результаты

source: Minimal Sendex Value
ru_ru: Минимальное значение Sendex

source: Count emails with such Sendex value or lower as not valid. Please use a value between 0 and 1. Default is %s.
ru_ru: Считать адреса электронной почты с таким значением Sendex и ниже неприемлемыми. Используйте значения от 0 до 1. Значение по умолчанию — %s.

source: Specify error messages to show when Kickbox verifies an email as not valid.
ru_ru: Добавьте сообщения, которые будут показаны для неприемлемых адресов электронной почты.

source: Error Messages
ru_ru: Сообщения об ошибках

source: Generic Error Message
ru_ru: Универсальное сообщение

source: Specifying error messages for specific Kickbox result reasons is available to developers via filters.
ru_ru: Разработчикам доступны фильтры для изменения сообщений об ошибках, соответствующих всем результатам проверки Kickbox.

source: Suggested Email Error Message
ru_ru: Сообщение, когда есть предполагаемое значение

source: This error message will be shown when a suggested email is returned if a possible spelling error was detected (%1$s). Use %2$s in the message, it'll be replaced with the one from Kickbox. Example: %3$s seems more like it.
ru_ru: Это сообщение будет показано, когда есть предполагаемое значение. Например, когда адрес электронной почты отправлен с опечаткой (%1$s). Предполагаемое значение заменит строку %2$s в сообщении. Например: Похоже, что %3$s лучше подходит.

source: Did you mean %s?
ru_ru: Вы имели в виду %s?

source: There seems to be an issue with your email address.
ru_ru: Возникла проблема с адресом электронной почты.

source: Enhance Gravity Forms with email verification via Kickbox.
ru_ru: Расширьте возможности Gravity Forms при помощи проверки через Kickbox.
